Revit 2027 API
ExporterIFCUtils.ExportExtrudedSlabOpeningsAndReturnInfo Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IFCOpeningDimensions> ExportExtrudedSlabOpeningsAndReturnInfo(
	ExporterIFC exporterIFC,
	Element pElem,
	IFCLevelInfo levelInfo,
	IFCAnyHandle localPlacementAny,
	IList<IFCAnyHandle> elementSlabAnyArr,
	IList<IList<CurveLoop>> extrusionLoops,
	Plane plane,
	IFCProductWrapper pWrapper
)
Public Shared Function ExportExtrudedSlabOpeningsAndReturnInfo (
	exporterIFC As ExporterIFC,
	pElem As Element,
	levelInfo As IFCLevelInfo,
	localPlacementAny As IFCAnyHandle,
	elementSlabAnyArr As IList(Of IFCAnyHandle),
	extrusionLoops As IList(Of IList(Of CurveLoop)),
	plane As Plane,
	pWrapper As IFCProductWrapper
) As IList(Of IFCOpeningDimensions)
public:
static IList<IFCOpeningDimensions^>^ ExportExtrudedSlabOpeningsAndReturnInfo(
	ExporterIFC^ exporterIFC,
	Element^ pElem,
	IFCLevelInfo^ levelInfo,
	IFCAnyHandle^ localPlacementAny,
	IList<IFCAnyHandle^>^ elementSlabAnyArr,
	IList<IList<CurveLoop^>^>^ extrusionLoops,
	Plane^ plane,
	IFCProductWrapper^ pWrapper
)
static member ExportExtrudedSlabOpeningsAndReturnInfo :
        exporterIFC : ExporterIFC *
        pElem : Element *
        levelInfo : IFCLevelInfo *
        localPlacementAny : IFCAnyHandle *
        elementSlabAnyArr : IList<IFCAnyHandle> *
        extrusionLoops : IList<IList<CurveLoop>> *
        plane : Plane *
        pWrapper : IFCProductWrapper -> IList<IFCOpeningDimensions>
Parameters
exporterIFC ExporterIFC
pElem Element
levelInfo IFCLevelInfo
localPlacementAny IFCAnyHandle
elementSlabAnyArr IList<IFCAnyHandle>
extrusionLoops IList<IList<CurveLoop>>
plane Plane
pWrapper IFCProductWrapper
Return Value
IList<IFCOpeningDimensions>
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace